zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_CAN.h
/*
** ###################################################################
**     Processors:          MC56F82313VLC
**                          MC56F82316VLF
**                          MC56F82323VFM
**                          MC56F82623VLC
**                          MC56F82643VLC
**                          MC56F82646VLF
**                          MC56F82723VFM
**                          MC56F82723VLC
**                          MC56F82726VLF
**                          MC56F82728VLH
**                          MC56F82733MFM
**                          MC56F82733VFM
**                          MC56F82733VLC
**                          MC56F82736VLF
**                          MC56F82738VLH
**                          MC56F82743VFM
**                          MC56F82743VLC
**                          MC56F82746MLF
**                          MC56F82746VLF
**                          MC56F82748MLH
**                          MC56F82748VLH
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for CAN
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2020-12-11)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_CAN.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for CAN
 *
 * CMSIS Peripheral Access Layer for CAN
 */

#if !defined(PERI_CAN_H_)
#define PERI_CAN_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F82313VLC))
#include "MC56F82313_COMMON.h"
#elif (defined(CPU_MC56F82316VLF))
#include "MC56F82316_COMMON.h"
#elif (defined(CPU_MC56F82323VFM))
#include "MC56F82323_COMMON.h"
#elif (defined(CPU_MC56F82623VLC))
#include "MC56F82623_COMMON.h"
#elif (defined(CPU_MC56F82643VLC))
#include "MC56F82643_COMMON.h"
#elif (defined(CPU_MC56F82646VLF))
#include "MC56F82646_COMMON.h"
#elif (defined(CPU_MC56F82723VFM) || defined(CPU_MC56F82723VLC))
#include "MC56F82723_COMMON.h"
#elif (defined(CPU_MC56F82726VLF))
#include "MC56F82726_COMMON.h"
#elif (defined(CPU_MC56F82728VLH))
#include "MC56F82728_COMMON.h"
#elif (defined(CPU_MC56F82733MFM) || defined(CPU_MC56F82733VFM) || defined(CPU_MC56F82733VLC))
#include "MC56F82733_COMMON.h"
#elif (defined(CPU_MC56F82736VLF))
#include "MC56F82736_COMMON.h"
#elif (defined(CPU_MC56F82738VLH))
#include "MC56F82738_COMMON.h"
#elif (defined(CPU_MC56F82743VFM) || defined(CPU_MC56F82743VLC))
#include "MC56F82743_COMMON.h"
#elif (defined(CPU_MC56F82746MLF) || defined(CPU_MC56F82746VLF))
#include "MC56F82746_COMMON.h"
#elif (defined(CPU_MC56F82748MLH) || defined(CPU_MC56F82748VLH))
#include "MC56F82748_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Peripheral_Access_Layer CAN Peripheral Access Layer
 * @{
 */

/** CAN - Size of Registers Arrays */
#define CAN_IDAR_BANK_0_COUNT                     4u
#define CAN_IDMR_BANK_0_COUNT                     4u
#define CAN_IDAR_BANK_1_COUNT                     4u
#define CAN_IDMR_BANK_1_COUNT                     4u
#define CAN_RXFG_DSR_COUNT                        8u
#define CAN_TXFG_DSR_COUNT                        8u

/** CAN - Register Layout Typedef */
typedef struct {
  __IO uint16_t CTL0;                              /**< MSCAN Control Register 0, offset: 0x0 */
  __IO uint16_t CTL1;                              /**< MSCAN Control Register 1, offset: 0x1 */
  __IO uint16_t BTR0;                              /**< MSCAN Bus Timing Register 0, offset: 0x2 */
  __IO uint16_t BTR1;                              /**< MSCAN Bus Timing Register 1, offset: 0x3 */
  __IO uint16_t RFLG;                              /**< MSCAN Receiver Flag Register, offset: 0x4 */
  __IO uint16_t RIER;                              /**< MSCAN Receiver Interrupt Enable Register, offset: 0x5 */
  __IO uint16_t TFLG;                              /**< MSCAN Transmitter Flag Register, offset: 0x6 */
  __IO uint16_t TIER;                              /**< MSCAN Transmitter Interrupt Enable Register, offset: 0x7 */
  __IO uint16_t TARQ;                              /**< MSCAN Transmitter Message Abort Request Register, offset: 0x8 */
  __I  uint16_t TAAK;                              /**< MSCAN Transmitter Message Abort Acknowledge Register, offset: 0x9 */
  __IO uint16_t TBSEL;                             /**< MSCAN Transmit Buffer Selection Register, offset: 0xA */
  __IO uint16_t IDAC;                              /**< MSCAN Identifier Acceptance Control Register, offset: 0xB */
       uint16_t RESERVED_0[1];
  __IO uint16_t MISC;                              /**< MSCAN Miscellaneous Register, offset: 0xD */
  __I  uint16_t RXERR;                             /**< MSCAN Receive Error Counter Register, offset: 0xE */
  __I  uint16_t TXERR;                             /**< MSCAN Transmit Error Counter Register, offset: 0xF */
  __IO uint16_t IDAR_BANK_0[CAN_IDAR_BANK_0_COUNT]; /**< MSCAN Identifier Acceptance Registers (First Bank), array offset: 0x10, array step: 0x1 */
  __IO uint16_t IDMR_BANK_0[CAN_IDMR_BANK_0_COUNT]; /**< MSCAN Identifier Mask Registers (First Bank), array offset: 0x14, array step: 0x1 */
  __IO uint16_t IDAR_BANK_1[CAN_IDAR_BANK_1_COUNT]; /**< MSCAN Identifier Acceptance Registers (Second Bank), array offset: 0x18, array step: 0x1 */
  __IO uint16_t IDMR_BANK_1[CAN_IDMR_BANK_1_COUNT]; /**< MSCAN Identifier Mask Registers (Second Bank), array offset: 0x1C, array step: 0x1 */
  union {                                          /* offset: 0x20 */
    __IO uint16_t RXFG_IDR0_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 0 - Extended Identifer Mapping, offset: 0x20 */
    __IO uint16_t RXFG_IDR0_STD;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 0 - Standard Identifer Mapping, offset: 0x20 */
  };
  union {                                          /* offset: 0x21 */
    __IO uint16_t RXFG_IDR1_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 1 - Extended Identifer Mapping, offset: 0x21 */
    __IO uint16_t RXFG_IDR1_STD;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 1 - Standard Identifier Mapping, offset: 0x21 */
  };
  __IO uint16_t RXFG_IDR2_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 2 - Extended Identifer Mapping, offset: 0x22 */
  __IO uint16_t RXFG_IDR3_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 3 - Extended Identifier Mapping, offset: 0x23 */
  __IO uint16_t RXFG_DSR[CAN_RXFG_DSR_COUNT];      /**< Receive Buffer Data Segment Registers, array offset: 0x24, array step: 0x1 */
  __IO uint16_t RXFG_DLR;                          /**< MSCAN Receive Buffer Data Length Register, offset: 0x2C */
       uint16_t RESERVED_1[1];
  __I  uint16_t RXFG_TSRH;                         /**< Receive Buffer Time Stamp Register - High Byte, offset: 0x2E */
  __I  uint16_t RXFG_TSRL;                         /**< Receive Buffer Time Stamp Register - Low Byte, offset: 0x2F */
  union {                                          /* offset: 0x30 */
    __IO uint16_t TXFG_IDR0_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 0 - Extended Identifer Mapping, offset: 0x30 */
    __IO uint16_t TXFG_IDR0_STD;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 0 - Standard Identifer Mapping, offset: 0x30 */
  };
  union {                                          /* offset: 0x31 */
    __IO uint16_t TXFG_IDR1_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 1 - Extended Identifer Mapping, offset: 0x31 */
    __IO uint16_t TXFG_IDR1_STD;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 1 - Standard Identifier Mapping, offset: 0x31 */
  };
  __IO uint16_t TXFG_IDR2_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 2 - Extended Identifer Mapping, offset: 0x32 */
  __IO uint16_t TXFG_IDR3_EXT;                     /**< MSCAN Receive and Transmit Buffer Identifier Register 3 - Extended Identifier Mapping, offset: 0x33 */
  __IO uint16_t TXFG_DSR[CAN_TXFG_DSR_COUNT];      /**< Transmit Buffer Data Segment Registers, array offset: 0x34, array step: 0x1 */
  __IO uint16_t TXFG_DLR;                          /**< MSCAN Transmit Buffer Data Length Register, offset: 0x3C */
  __IO uint16_t TXFG_TBPR;                         /**< MSCAN Transmit Buffer Priority Register, offset: 0x3D */
  __I  uint16_t TXFG_TSRH;                         /**< Transmit Buffer Time Stamp Register - High Byte, offset: 0x3E */
  __I  uint16_t TXFG_TSRL;                         /**< Transmit Buffer Time Stamp Register - Low Byte, offset: 0x3F */
} CAN_Type;

/* ----------------------------------------------------------------------------
   -- CAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Register_Masks CAN Register Masks
 * @{
 */

/*! @name CTL0 - MSCAN Control Register 0 */
/*! @{ */

#define CAN_CTL0_INITRQ_MASK                     (0x1U)
#define CAN_CTL0_INITRQ_SHIFT                    (0U)
/*! INITRQ - Initialization Mode Request
 *  0b0..Normal operation
 *  0b1..MSCAN in initialization mode
 */
#define CAN_CTL0_INITRQ(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_INITRQ_SHIFT)) & CAN_CTL0_INITRQ_MASK)

#define CAN_CTL0_SLPRQ_MASK                      (0x2U)
#define CAN_CTL0_SLPRQ_SHIFT                     (1U)
/*! SLPRQ - Sleep Mode Request
 *  0b0..Running - The MSCAN functions normally
 *  0b1..Sleep mode request - The MSCAN enters sleep mode when CAN bus idle
 */
#define CAN_CTL0_SLPRQ(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_SLPRQ_SHIFT)) & CAN_CTL0_SLPRQ_MASK)

#define CAN_CTL0_WUPE_MASK                       (0x4U)
#define CAN_CTL0_WUPE_SHIFT                      (2U)
/*! WUPE - Wake-Up Enable
 *  0b0..Wake-up disabled - The MSCAN ignores traffic on CAN
 *  0b1..Wake-up enabled - The MSCAN is able to restart
 */
#define CAN_CTL0_WUPE(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_WUPE_SHIFT)) & CAN_CTL0_WUPE_MASK)

