zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_CAN.h
#define CAN_CTL0_TIME_MASK                       (0x8U)
#define CAN_CTL0_TIME_SHIFT                      (3U)
/*! TIME - Timer Enable
 *  0b0..Disable internal MSCAN timer
 *  0b1..Enable internal MSCAN timer
 */
#define CAN_CTL0_TIME(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_TIME_SHIFT)) & CAN_CTL0_TIME_MASK)

#define CAN_CTL0_SYNCH_MASK                      (0x10U)
#define CAN_CTL0_SYNCH_SHIFT                     (4U)
/*! SYNCH - Synchronized Status
 *  0b0..MSCAN is not synchronized to the CAN bus
 *  0b1..MSCAN is synchronized to the CAN bus
 */
#define CAN_CTL0_SYNCH(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_SYNCH_SHIFT)) & CAN_CTL0_SYNCH_MASK)

#define CAN_CTL0_CSWAI_MASK                      (0x20U)
#define CAN_CTL0_CSWAI_SHIFT                     (5U)
/*! CSWAI - CAN Stops in Wait Mode
 *  0b0..The module is not affected during wait mode
 *  0b1..The module ceases to be clocked during wait mode
 */
#define CAN_CTL0_CSWAI(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_CSWAI_SHIFT)) & CAN_CTL0_CSWAI_MASK)

#define CAN_CTL0_RXACT_MASK                      (0x40U)
#define CAN_CTL0_RXACT_SHIFT                     (6U)
/*! RXACT - Receiver Active Status
 *  0b0..MSCAN is transmitting or idle
 *  0b1..MSCAN is receiving a message (including when arbitration is lost)
 */
#define CAN_CTL0_RXACT(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_RXACT_SHIFT)) & CAN_CTL0_RXACT_MASK)

#define CAN_CTL0_RXFRM_MASK                      (0x80U)
#define CAN_CTL0_RXFRM_SHIFT                     (7U)
/*! RXFRM - Received Frame Flag
 *  0b0..No valid message was received since last clearing this flag
 *  0b1..A valid message was received since last clearing of this flag
 */
#define CAN_CTL0_RXFRM(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL0_RXFRM_SHIFT)) & CAN_CTL0_RXFRM_MASK)
/*! @} */

/*! @name CTL1 - MSCAN Control Register 1 */
/*! @{ */

#define CAN_CTL1_INITAK_MASK                     (0x1U)
#define CAN_CTL1_INITAK_SHIFT                    (0U)
/*! INITAK - Initialization Mode Acknowledge
 *  0b0..Running - The MSCAN operates normally
 *  0b1..Initialization mode active - The MSCAN has entered initialization mode
 */
#define CAN_CTL1_INITAK(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_INITAK_SHIFT)) & CAN_CTL1_INITAK_MASK)

#define CAN_CTL1_SLPAK_MASK                      (0x2U)
#define CAN_CTL1_SLPAK_SHIFT                     (1U)
/*! SLPAK - Sleep Mode Acknowledge
 *  0b0..Running - The MSCAN operates normally
 *  0b1..Sleep mode active - The MSCAN has entered sleep mode
 */
#define CAN_CTL1_SLPAK(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_SLPAK_SHIFT)) & CAN_CTL1_SLPAK_MASK)

#define CAN_CTL1_WUPM_MASK                       (0x4U)
#define CAN_CTL1_WUPM_SHIFT                      (2U)
/*! WUPM - Wake-Up Mode
 *  0b0..MSCAN wakes up on any dominant level on the CAN bus
 *  0b1..MSCAN wakes up only in case of a dominant pulse on the CAN bus that has a length of T WAKEUP
 */
#define CAN_CTL1_WUPM(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_WUPM_SHIFT)) & CAN_CTL1_WUPM_MASK)

#define CAN_CTL1_BORM_MASK                       (0x8U)
#define CAN_CTL1_BORM_SHIFT                      (3U)
/*! BORM - Bus-Off Recovery Mode
 *  0b0..Automatic bus-off recovery (see Bosch CAN 2.0A/B protocol specification)
 *  0b1..Bus-off recovery upon user request
 */
#define CAN_CTL1_BORM(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_BORM_SHIFT)) & CAN_CTL1_BORM_MASK)

#define CAN_CTL1_LISTEN_MASK                     (0x10U)
#define CAN_CTL1_LISTEN_SHIFT                    (4U)
/*! LISTEN - Listen Only Mode
 *  0b0..Normal operation
 *  0b1..Listen only mode activated
 */
#define CAN_CTL1_LISTEN(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_LISTEN_SHIFT)) & CAN_CTL1_LISTEN_MASK)

#define CAN_CTL1_LOOPB_MASK                      (0x20U)
#define CAN_CTL1_LOOPB_SHIFT                     (5U)
/*! LOOPB - Loop Back Self Test Mode
 *  0b0..Loopback self test disabled
 *  0b1..Loopback self test enabled
 */
#define CAN_CTL1_LOOPB(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_LOOPB_SHIFT)) & CAN_CTL1_LOOPB_MASK)

#define CAN_CTL1_CLKSRC_MASK                     (0x40U)
#define CAN_CTL1_CLKSRC_SHIFT                    (6U)
/*! CLKSRC - MSCAN Clock Source
 *  0b0..MSCAN clock source is the oscillator clock
 *  0b1..MSCAN clock source is the bus clock
 */
#define CAN_CTL1_CLKSRC(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_CLKSRC_SHIFT)) & CAN_CTL1_CLKSRC_MASK)

#define CAN_CTL1_CANE_MASK                       (0x80U)
#define CAN_CTL1_CANE_SHIFT                      (7U)
/*! CANE - CAN Enable
 *  0b0..MSCAN module is disabled
 *  0b1..MSCAN module is enabled
 */
#define CAN_CTL1_CANE(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_CTL1_CANE_SHIFT)) & CAN_CTL1_CANE_MASK)
/*! @} */

/*! @name BTR0 - MSCAN Bus Timing Register 0 */
/*! @{ */

#define CAN_BTR0_BRP_MASK                        (0x3FU)
#define CAN_BTR0_BRP_SHIFT                       (0U)
/*! BRP - Baud Rate Prescaler */
#define CAN_BTR0_BRP(x)                          (((uint16_t)(((uint16_t)(x)) << CAN_BTR0_BRP_SHIFT)) & CAN_BTR0_BRP_MASK)

#define CAN_BTR0_SJW_MASK                        (0xC0U)
#define CAN_BTR0_SJW_SHIFT                       (6U)
/*! SJW - Synchronization Jump Width
 *  0b00..Synchronization Jump Width 1 Tq Clock Cycle
 *  0b01..Synchronization Jump Width 2 Tq Clock Cycle
 *  0b10..Synchronization Jump Width 3 Tq Clock Cycle
 *  0b11..Synchronization Jump Width 4 Tq Clock Cycle
 */
#define CAN_BTR0_SJW(x)                          (((uint16_t)(((uint16_t)(x)) << CAN_BTR0_SJW_SHIFT)) & CAN_BTR0_SJW_MASK)
/*! @} */

/*! @name BTR1 - MSCAN Bus Timing Register 1 */
/*! @{ */

#define CAN_BTR1_TSEG1_MASK                      (0xFU)
#define CAN_BTR1_TSEG1_SHIFT                     (0U)
/*! TSEG1 - Time Segment 1
 *  0b0000..1 Tq clock cycles (This setting is not valid)
 *  0b0001..2 Tq clock cycles (This setting is not valid)
 *  0b0010..3 Tq clock cycles (This setting is not valid)
 *  0b0011..4 Tq clock cycles
 *  0b0100..5 Tq clock cycles
 *  0b0101..6 Tq clock cycles
 *  0b0110..7 Tq clock cycles
 *  0b0111..8 Tq clock cycles
 *  0b1000..9 Tq clock cycles
 *  0b1001..10 Tq clock cycles
 *  0b1010..11 Tq clock cycles
 *  0b1011..12 Tq clock cycles
 *  0b1100..13 Tq clock cycles
 *  0b1101..14 Tq clock cycles
 *  0b1110..15 Tq clock cycles
 *  0b1111..16 Tq clock cycles
 */
#define CAN_BTR1_TSEG1(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_BTR1_TSEG1_SHIFT)) & CAN_BTR1_TSEG1_MASK)

#define CAN_BTR1_TSEG2_MASK                      (0x70U)
#define CAN_BTR1_TSEG2_SHIFT                     (4U)
/*! TSEG2 - Time Segment 2
 *  0b000..1 Tq clock cycle (This setting is not valid)
 *  0b001..2 Tq clock cycles
 *  0b010..3 Tq clock cycles
 *  0b011..4 Tq clock cycles
 *  0b100..5 Tq clock cycles
 *  0b101..6 Tq clock cycles
 *  0b110..7 Tq clock cycles
 *  0b111..8 Tq clock cycles
 */
#define CAN_BTR1_TSEG2(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_BTR1_TSEG2_SHIFT)) & CAN_BTR1_TSEG2_MASK)

