zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_CAN.h
#define CAN_BTR1_SAMP_MASK                       (0x80U)
#define CAN_BTR1_SAMP_SHIFT                      (7U)
/*! SAMP - Sampling
 *  0b0..One sample per bit. The resulting bit value is equal to the value of the single bit positioned at the sample point.
 *  0b1..Three samples per bit. In this case, PHASE_SEG1 must be at least 2 time quanta (Tq). The resulting bit
 *       value is determined by using majority rule on the three total samples. For higher bit rates, it is
 *       recommended that only one sample is taken per bit time (SAMP=0)
 */
#define CAN_BTR1_SAMP(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_BTR1_SAMP_SHIFT)) & CAN_BTR1_SAMP_MASK)
/*! @} */

/*! @name RFLG - MSCAN Receiver Flag Register */
/*! @{ */

#define CAN_RFLG_RXF_MASK                        (0x1U)
#define CAN_RFLG_RXF_SHIFT                       (0U)
/*! RXF - Receive Buffer Full Flag
 *  0b0..No new message available within the RxFG
 *  0b1..The receiver FIFO is not empty. A new message is available in the RxFG
 */
#define CAN_RFLG_RXF(x)                          (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_RXF_SHIFT)) & CAN_RFLG_RXF_MASK)

#define CAN_RFLG_OVRIF_MASK                      (0x2U)
#define CAN_RFLG_OVRIF_SHIFT                     (1U)
/*! OVRIF - Overrun Interrupt Flag
 *  0b0..No data overrun condition
 *  0b1..A data overrun detected
 */
#define CAN_RFLG_OVRIF(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_OVRIF_SHIFT)) & CAN_RFLG_OVRIF_MASK)

#define CAN_RFLG_TSTAT_MASK                      (0xCU)
#define CAN_RFLG_TSTAT_SHIFT                     (2U)
/*! TSTAT - Transmitter Status Bits
 *  0b00..TxOK: 0 <= transmit error counter <= 96
 *  0b01..TxWRN: 96 < transmit error counter <= 127
 *  0b10..TxERR: 127 < transmit error counter <= 255
 *  0b11..Bus-Off: transmit error counter > 255
 */
#define CAN_RFLG_TSTAT(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_TSTAT_SHIFT)) & CAN_RFLG_TSTAT_MASK)

#define CAN_RFLG_RSTAT_MASK                      (0x30U)
#define CAN_RFLG_RSTAT_SHIFT                     (4U)
/*! RSTAT - Receiver Status Bits
 *  0b00..RxOK: 0 <= receiver error counter <= 96
 *  0b01..RxWRN: 96 < receiver error counter <= 127
 *  0b10..RxERR: 127 < receiver error counter <= 255
 *  0b11..Bus-Off: receiver error counter > 255
 */
#define CAN_RFLG_RSTAT(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_RSTAT_SHIFT)) & CAN_RFLG_RSTAT_MASK)

#define CAN_RFLG_CSCIF_MASK                      (0x40U)
#define CAN_RFLG_CSCIF_SHIFT                     (6U)
/*! CSCIF - CAN Status Change Interrupt Flag
 *  0b0..No change in CAN bus status occurred since last interrupt
 *  0b1..MSCAN changed current CAN bus status
 */
#define CAN_RFLG_CSCIF(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_CSCIF_SHIFT)) & CAN_RFLG_CSCIF_MASK)

#define CAN_RFLG_WUPIF_MASK                      (0x80U)
#define CAN_RFLG_WUPIF_SHIFT                     (7U)
/*! WUPIF - Wake-up Interrupt Flag
 *  0b0..No wakeup activity observed while in sleep mode
 *  0b1..MSCAN detected activity on the CAN bus and requested wakeup
 */
#define CAN_RFLG_WUPIF(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RFLG_WUPIF_SHIFT)) & CAN_RFLG_WUPIF_MASK)
/*! @} */

/*! @name RIER - MSCAN Receiver Interrupt Enable Register */
/*! @{ */

#define CAN_RIER_RXFIE_MASK                      (0x1U)
#define CAN_RIER_RXFIE_SHIFT                     (0U)
/*! RXFIE - Receiver Full Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A receive buffer full (successful message reception) event causes a receiver interrupt request.
 */
#define CAN_RIER_RXFIE(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RIER_RXFIE_SHIFT)) & CAN_RIER_RXFIE_MASK)

#define CAN_RIER_OVRIE_MASK                      (0x2U)
#define CAN_RIER_OVRIE_SHIFT                     (1U)
/*! OVRIE - Overrun Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..An overrun event causes an error interrupt request.
 */
#define CAN_RIER_OVRIE(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RIER_OVRIE_SHIFT)) & CAN_RIER_OVRIE_MASK)

#define CAN_RIER_TSTATE_MASK                     (0xCU)
#define CAN_RIER_TSTATE_SHIFT                    (2U)
/*! TSTATE - Transmitter Status Change Enable
 *  0b00..Do not generate any CSCIF interrupt caused by transmitter state changes.
 *  0b01..Generate CSCIF interrupt only if the transmitter enters or leaves "bus-off" state. Discard other
 *        transmitter state changes for generating CSCIF interrupt.
 *  0b10..Generate CSCIF interrupt only if the transmitter enters or leaves "TxErr" or "bus-off" state. Discard
 *        other transmitter state changes for generating CSCIF interrupt.
 *  0b11..Generate CSCIF interrupt on all state changes.
 */
#define CAN_RIER_TSTATE(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_RIER_TSTATE_SHIFT)) & CAN_RIER_TSTATE_MASK)

#define CAN_RIER_RSTATE_MASK                     (0x30U)
#define CAN_RIER_RSTATE_SHIFT                    (4U)
/*! RSTATE - Receiver Status Change Enable
 *  0b00..Do not generate any CSCIF interrupt caused by transmitter state changes.
 *  0b01..Generate CSCIF interrupt only if the transmitter enters or leaves "bus-off" state. Discard other
 *        transmitter state changes for generating CSCIF interrupt.
 *  0b10..Generate CSCIF interrupt only if the transmitter enters or leaves "TxErr" or "bus-off" state. Discard
 *        other transmitter state changes for generating CSCIF interrupt.
 *  0b11..Generate CSCIF interrupt on all state changes.
 */
#define CAN_RIER_RSTATE(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_RIER_RSTATE_SHIFT)) & CAN_RIER_RSTATE_MASK)

#define CAN_RIER_CSCIE_MASK                      (0x40U)
#define CAN_RIER_CSCIE_SHIFT                     (6U)
/*! CSCIE - CAN Status Change Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A CAN status change event causes an error interrupt request.
 */
#define CAN_RIER_CSCIE(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RIER_CSCIE_SHIFT)) & CAN_RIER_CSCIE_MASK)

#define CAN_RIER_WUPIE_MASK                      (0x80U)
#define CAN_RIER_WUPIE_SHIFT                     (7U)
/*! WUPIE - Wake-up Interrupt Enable
 *  0b0..No interrupt request is generated from this event.
 *  0b1..A wake-up event causes a Wake-Up interrupt request.
 */
#define CAN_RIER_WUPIE(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_RIER_WUPIE_SHIFT)) & CAN_RIER_WUPIE_MASK)
/*! @} */

/*! @name TFLG - MSCAN Transmitter Flag Register */
/*! @{ */

#define CAN_TFLG_TXE_MASK                        (0x7U)
#define CAN_TFLG_TXE_SHIFT                       (0U)
/*! TXE - Transmitter Buffer Empty
 *  0b000..The associated message buffer is full (loaded with a message due for transmission)
 *  0b001..The associated message buffer is empty (not scheduled)
 */
#define CAN_TFLG_TXE(x)                          (((uint16_t)(((uint16_t)(x)) << CAN_TFLG_TXE_SHIFT)) & CAN_TFLG_TXE_MASK)
/*! @} */

/*! @name TIER - MSCAN Transmitter Interrupt Enable Register */
/*! @{ */

#define CAN_TIER_TXEIE_MASK                      (0x7U)
#define CAN_TIER_TXEIE_SHIFT                     (0U)
/*! TXEIE - Transmitter Empty Interrupt Enable
 *  0b000..No interrupt request is generated from this event.
 *  0b001..A transmitter empty (transmit buffer available for transmission) event causes a transmitter empty interrupt request.
 */
#define CAN_TIER_TXEIE(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_TIER_TXEIE_SHIFT)) & CAN_TIER_TXEIE_MASK)
/*! @} */

/*! @name TARQ - MSCAN Transmitter Message Abort Request Register */
/*! @{ */

