zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_CAN.h
#define CAN_TARQ_ABTRQ_MASK                      (0x7U)
#define CAN_TARQ_ABTRQ_SHIFT                     (0U)
/*! ABTRQ - Abort Request
 *  0b000..No abort request
 *  0b001..Abort request pending
 */
#define CAN_TARQ_ABTRQ(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_TARQ_ABTRQ_SHIFT)) & CAN_TARQ_ABTRQ_MASK)
/*! @} */

/*! @name TAAK - MSCAN Transmitter Message Abort Acknowledge Register */
/*! @{ */

#define CAN_TAAK_ABTAK_MASK                      (0x7U)
#define CAN_TAAK_ABTAK_SHIFT                     (0U)
/*! ABTAK - Abort Acknowledge
 *  0b000..The message was not aborted.
 *  0b001..The message was aborted.
 */
#define CAN_TAAK_ABTAK(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_TAAK_ABTAK_SHIFT)) & CAN_TAAK_ABTAK_MASK)
/*! @} */

/*! @name TBSEL - MSCAN Transmit Buffer Selection Register */
/*! @{ */

#define CAN_TBSEL_TX_MASK                        (0x7U)
#define CAN_TBSEL_TX_SHIFT                       (0U)
/*! TX - Transmit Buffer Select
 *  0b000..The associated message buffer is deselected
 *  0b001..The associated message buffer is selected, if lowest numbered bit
 */
#define CAN_TBSEL_TX(x)                          (((uint16_t)(((uint16_t)(x)) << CAN_TBSEL_TX_SHIFT)) & CAN_TBSEL_TX_MASK)
/*! @} */

/*! @name IDAC - MSCAN Identifier Acceptance Control Register */
/*! @{ */

#define CAN_IDAC_IDHIT_MASK                      (0x7U)
#define CAN_IDAC_IDHIT_SHIFT                     (0U)
/*! IDHIT - Identifier Acceptance Hit Indicator
 *  0b000..Filter 0 Hit
 *  0b001..Filter 1 Hit
 *  0b010..Filter 2 Hit
 *  0b011..Filter 3 Hit
 *  0b100..Filter 4 Hit
 *  0b101..Filter 5 Hit
 *  0b110..Filter 6 Hit
 *  0b111..Filter 7 Hit
 */
#define CAN_IDAC_IDHIT(x)                        (((uint16_t)(((uint16_t)(x)) << CAN_IDAC_IDHIT_SHIFT)) & CAN_IDAC_IDHIT_MASK)

#define CAN_IDAC_IDAM_MASK                       (0x30U)
#define CAN_IDAC_IDAM_SHIFT                      (4U)
/*! IDAM - ID Acceptance Mode
 *  0b00..Two 32-Bit Acceptance Filters
 *  0b01..Four 16-Bit Acceptance Filters
 *  0b10..Eight 8-Bit Acceptance Filters
 *  0b11..Filter Closed
 */
#define CAN_IDAC_IDAM(x)                         (((uint16_t)(((uint16_t)(x)) << CAN_IDAC_IDAM_SHIFT)) & CAN_IDAC_IDAM_MASK)
/*! @} */

/*! @name MISC - MSCAN Miscellaneous Register */
/*! @{ */

#define CAN_MISC_BOHOLD_MASK                     (0x1U)
#define CAN_MISC_BOHOLD_SHIFT                    (0U)
/*! BOHOLD - Bus-off State Hold Until User Request
 *  0b0..Module is not in bus-off state, or recovery has been requested by user in bus-off state
 *  0b1..Module is in bus-off state and holds this state until user requests recovery
 */
#define CAN_MISC_BOHOLD(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_MISC_BOHOLD_SHIFT)) & CAN_MISC_BOHOLD_MASK)
/*! @} */

/*! @name RXERR - MSCAN Receive Error Counter Register */
/*! @{ */

#define CAN_RXERR_RXERR_MASK                     (0xFFU)
#define CAN_RXERR_RXERR_SHIFT                    (0U)
/*! RXERR - MSCAN Receive Error Counter Bits */
#define CAN_RXERR_RXERR(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_RXERR_RXERR_SHIFT)) & CAN_RXERR_RXERR_MASK)
/*! @} */

/*! @name TXERR - MSCAN Transmit Error Counter Register */
/*! @{ */

#define CAN_TXERR_TXERR_MASK                     (0xFFU)
#define CAN_TXERR_TXERR_SHIFT                    (0U)
/*! TXERR - MSCAN Transmit Error Counter Bits */
#define CAN_TXERR_TXERR(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_TXERR_TXERR_SHIFT)) & CAN_TXERR_TXERR_MASK)
/*! @} */

/*! @name IDAR_BANK_0 - MSCAN Identifier Acceptance Registers (First Bank) */
/*! @{ */

#define CAN_IDAR_BANK_0_AC_MASK                  (0xFFU)
#define CAN_IDAR_BANK_0_AC_SHIFT                 (0U)
/*! AC - Acceptance Code Bits */
#define CAN_IDAR_BANK_0_AC(x)                    (((uint16_t)(((uint16_t)(x)) << CAN_IDAR_BANK_0_AC_SHIFT)) & CAN_IDAR_BANK_0_AC_MASK)
/*! @} */

/*! @name IDMR_BANK_0 - MSCAN Identifier Mask Registers (First Bank) */
/*! @{ */

#define CAN_IDMR_BANK_0_AM_MASK                  (0xFFU)
#define CAN_IDMR_BANK_0_AM_SHIFT                 (0U)
/*! AM - Acceptance Mask Bits
 *  0b00000000..Match corresponding acceptance code register and identifier bits
 *  0b00000001..Ignore corresponding acceptance code register bit
 */
#define CAN_IDMR_BANK_0_AM(x)                    (((uint16_t)(((uint16_t)(x)) << CAN_IDMR_BANK_0_AM_SHIFT)) & CAN_IDMR_BANK_0_AM_MASK)
/*! @} */

/*! @name IDAR_BANK_1 - MSCAN Identifier Acceptance Registers (Second Bank) */
/*! @{ */

#define CAN_IDAR_BANK_1_AC_MASK                  (0xFFU)
#define CAN_IDAR_BANK_1_AC_SHIFT                 (0U)
/*! AC - Acceptance Code Bits */
#define CAN_IDAR_BANK_1_AC(x)                    (((uint16_t)(((uint16_t)(x)) << CAN_IDAR_BANK_1_AC_SHIFT)) & CAN_IDAR_BANK_1_AC_MASK)
/*! @} */

/*! @name IDMR_BANK_1 - MSCAN Identifier Mask Registers (Second Bank) */
/*! @{ */

#define CAN_IDMR_BANK_1_AM_MASK                  (0xFFU)
#define CAN_IDMR_BANK_1_AM_SHIFT                 (0U)
/*! AM - Acceptance Mask Bits
 *  0b00000000..Match corresponding acceptance code register and identifier bits
 *  0b00000001..Ignore corresponding acceptance code register bit
 */
#define CAN_IDMR_BANK_1_AM(x)                    (((uint16_t)(((uint16_t)(x)) << CAN_IDMR_BANK_1_AM_SHIFT)) & CAN_IDMR_BANK_1_AM_MASK)
/*! @} */

/*! @name RXFG_IDR0_EXT - MSCAN Receive and Transmit Buffer Identifier Register 0 - Extended Identifer Mapping */
/*! @{ */

#define CAN_RXFG_IDR0_EXT_ID_MASK                (0xFFU)
#define CAN_RXFG_IDR0_EXT_ID_SHIFT               (0U)
/*! ID - Extended Format Identifier */
#define CAN_RXFG_IDR0_EXT_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR0_EXT_ID_SHIFT)) & CAN_RXFG_IDR0_EXT_ID_MASK)
/*! @} */

/*! @name RXFG_IDR0_STD - MSCAN Receive and Transmit Buffer Identifier Register 0 - Standard Identifer Mapping */
/*! @{ */

#define CAN_RXFG_IDR0_STD_ID_MASK                (0xFFU)
#define CAN_RXFG_IDR0_STD_ID_SHIFT               (0U)
/*! ID - Standard Format Identifier */
#define CAN_RXFG_IDR0_STD_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR0_STD_ID_SHIFT)) & CAN_RXFG_IDR0_STD_ID_MASK)
/*! @} */

