zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/periph/PERI_CAN.h
/*! @name RXFG_IDR1_EXT - MSCAN Receive and Transmit Buffer Identifier Register 1 - Extended Identifer Mapping */
/*! @{ */

#define CAN_RXFG_IDR1_EXT_ID_17_15_MASK          (0x7U)
#define CAN_RXFG_IDR1_EXT_ID_17_15_SHIFT         (0U)
/*! ID_17_15 - Extended Format Identifier */
#define CAN_RXFG_IDR1_EXT_ID_17_15(x)            (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_EXT_ID_17_15_SHIFT)) & CAN_RXFG_IDR1_EXT_ID_17_15_MASK)

#define CAN_RXFG_IDR1_EXT_IDE_MASK               (0x8U)
#define CAN_RXFG_IDR1_EXT_IDE_SHIFT              (3U)
/*! IDE - ID Extended (set to 1)
 *  0b0..Standard format (11 bit)
 *  0b1..Extended format (29 bit)
 */
#define CAN_RXFG_IDR1_EXT_IDE(x)                 (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_EXT_IDE_SHIFT)) & CAN_RXFG_IDR1_EXT_IDE_MASK)

#define CAN_RXFG_IDR1_EXT_SRR_MASK               (0x10U)
#define CAN_RXFG_IDR1_EXT_SRR_SHIFT              (4U)
/*! SRR - Substitute Remote Request (set to 1) */
#define CAN_RXFG_IDR1_EXT_SRR(x)                 (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_EXT_SRR_SHIFT)) & CAN_RXFG_IDR1_EXT_SRR_MASK)

#define CAN_RXFG_IDR1_EXT_ID_20_18_MASK          (0xE0U)
#define CAN_RXFG_IDR1_EXT_ID_20_18_SHIFT         (5U)
/*! ID_20_18 - Extended Format Identifier */
#define CAN_RXFG_IDR1_EXT_ID_20_18(x)            (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_EXT_ID_20_18_SHIFT)) & CAN_RXFG_IDR1_EXT_ID_20_18_MASK)
/*! @} */

/*! @name RXFG_IDR1_STD - MSCAN Receive and Transmit Buffer Identifier Register 1 - Standard Identifier Mapping */
/*! @{ */

#define CAN_RXFG_IDR1_STD_IDE_MASK               (0x8U)
#define CAN_RXFG_IDR1_STD_IDE_SHIFT              (3U)
/*! IDE - ID Extended (set to 0)
 *  0b0..Standard format (11 bit)
 *  0b1..Extended format (29 bit)
 */
#define CAN_RXFG_IDR1_STD_IDE(x)                 (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_STD_IDE_SHIFT)) & CAN_RXFG_IDR1_STD_IDE_MASK)

#define CAN_RXFG_IDR1_STD_RTR_MASK               (0x10U)
#define CAN_RXFG_IDR1_STD_RTR_SHIFT              (4U)
/*! RTR - Remote Transmission Request
 *  0b0..Data frame
 *  0b1..Remote frame
 */
#define CAN_RXFG_IDR1_STD_RTR(x)                 (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_STD_RTR_SHIFT)) & CAN_RXFG_IDR1_STD_RTR_MASK)

#define CAN_RXFG_IDR1_STD_ID_MASK                (0xE0U)
#define CAN_RXFG_IDR1_STD_ID_SHIFT               (5U)
/*! ID - Standard Format Identifier */
#define CAN_RXFG_IDR1_STD_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR1_STD_ID_SHIFT)) & CAN_RXFG_IDR1_STD_ID_MASK)
/*! @} */

/*! @name RXFG_IDR2_EXT - MSCAN Receive and Transmit Buffer Identifier Register 2 - Extended Identifer Mapping */
/*! @{ */

#define CAN_RXFG_IDR2_EXT_ID_MASK                (0xFFU)
#define CAN_RXFG_IDR2_EXT_ID_SHIFT               (0U)
/*! ID - Extended Format Identifier */
#define CAN_RXFG_IDR2_EXT_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR2_EXT_ID_SHIFT)) & CAN_RXFG_IDR2_EXT_ID_MASK)
/*! @} */

/*! @name RXFG_IDR3_EXT - MSCAN Receive and Transmit Buffer Identifier Register 3 - Extended Identifier Mapping */
/*! @{ */

#define CAN_RXFG_IDR3_EXT_RTR_MASK               (0x1U)
#define CAN_RXFG_IDR3_EXT_RTR_SHIFT              (0U)
/*! RTR - Remote Transmission Request
 *  0b0..Data frame
 *  0b1..Remote frame
 */
#define CAN_RXFG_IDR3_EXT_RTR(x)                 (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR3_EXT_RTR_SHIFT)) & CAN_RXFG_IDR3_EXT_RTR_MASK)

#define CAN_RXFG_IDR3_EXT_ID_MASK                (0xFEU)
#define CAN_RXFG_IDR3_EXT_ID_SHIFT               (1U)
/*! ID - Extended Format Identifier */
#define CAN_RXFG_IDR3_EXT_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_IDR3_EXT_ID_SHIFT)) & CAN_RXFG_IDR3_EXT_ID_MASK)
/*! @} */

/*! @name RXFG_DSR - Receive Buffer Data Segment Registers */
/*! @{ */

#define CAN_RXFG_DSR_DB_MASK                     (0xFFU)
#define CAN_RXFG_DSR_DB_SHIFT                    (0U)
/*! DB - Data bits 7-0 */
#define CAN_RXFG_DSR_DB(x)                       (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_DSR_DB_SHIFT)) & CAN_RXFG_DSR_DB_MASK)
/*! @} */

/*! @name RXFG_DLR - MSCAN Receive Buffer Data Length Register */
/*! @{ */

#define CAN_RXFG_DLR_DLC_MASK                    (0xFU)
#define CAN_RXFG_DLR_DLC_SHIFT                   (0U)
/*! DLC - Data Length Code
 *  0b0000..Data Byte Count 0
 *  0b0001..Data Byte Count 1
 *  0b0010..Data Byte Count 2
 *  0b0011..Data Byte Count 3
 *  0b0100..Data Byte Count 4
 *  0b0101..Data Byte Count 5
 *  0b0110..Data Byte Count 6
 *  0b0111..Data Byte Count 7
 *  0b1000..Data Byte Count 8
 */
#define CAN_RXFG_DLR_DLC(x)                      (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_DLR_DLC_SHIFT)) & CAN_RXFG_DLR_DLC_MASK)
/*! @} */

/*! @name RXFG_TSRH - Receive Buffer Time Stamp Register - High Byte */
/*! @{ */

#define CAN_RXFG_TSRH_TSR_MASK                   (0xFFU)
#define CAN_RXFG_TSRH_TSR_SHIFT                  (0U)
/*! TSR - Time Stamp Register Bits 15-8 */
#define CAN_RXFG_TSRH_TSR(x)                     (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_TSRH_TSR_SHIFT)) & CAN_RXFG_TSRH_TSR_MASK)
/*! @} */

/*! @name RXFG_TSRL - Receive Buffer Time Stamp Register - Low Byte */
/*! @{ */

#define CAN_RXFG_TSRL_TSR_MASK                   (0xFFU)
#define CAN_RXFG_TSRL_TSR_SHIFT                  (0U)
/*! TSR - Time Stamp Register Bits 7-0 */
#define CAN_RXFG_TSRL_TSR(x)                     (((uint16_t)(((uint16_t)(x)) << CAN_RXFG_TSRL_TSR_SHIFT)) & CAN_RXFG_TSRL_TSR_MASK)
/*! @} */

/*! @name TXFG_IDR0_EXT - MSCAN Receive and Transmit Buffer Identifier Register 0 - Extended Identifer Mapping */
/*! @{ */

#define CAN_TXFG_IDR0_EXT_ID_MASK                (0xFFU)
#define CAN_TXFG_IDR0_EXT_ID_SHIFT               (0U)
/*! ID - Extended Format Identifier */
#define CAN_TXFG_IDR0_EXT_ID(x)                  (((uint16_t)(((uint16_t)(x)) << CAN_TXFG_IDR0_EXT_ID_SHIFT)) & CAN_TXFG_IDR0_EXT_ID_MASK)
/*! @} */

/*! @name TXFG_IDR0_STD - MSCAN Receive and Transmit Buffer Identifier Register 0 - Standard Identifer Mapping */
/*! @{ */

